app/Http/Controllers/Api/MenorPrecoController.php

insert into `menorpreco_produtos` (`gtin`, `ncm`, `palavrachave`, `descricao`, `volume`, `unidade`, `categoria`, `local`, `updated_at`, `created_at`) values ('07896031213167', '02013000', 'Patinho', 'PATINHO MOIDO FRIBOI RESERVA 400G', 0, 'UN', '58', '6g9fp8frx', '2026-01-24 21:40:51', '2026-01-24 21:40:51')
select * from `menorpreco_produtos` where (`gtin` = '07896031213167' and `ncm` = '02013000') limit 1
---

            /** ---------------- PRODUTO ---------------- */
            // Usa GTIN + NCM como chave única
            $produto = MenorprecoProduto::firstOrCreate(
                [
                    'gtin' => $p['gtin'] ?? null,
                    'ncm'  => $p['ncm'] ?? null,
                ],
                [
                    'palavrachave' => $termo ?? ($p['desc'] ?? null),
                    'descricao'    => $p['desc'] ?? null,
                    'volume'       => 0,
                    'unidade'      => 'UN',
                    'categoria'    => $categoria,
                    'local'        => $local,
                ]
            );

insert into `menorpreco_estabelecimentos` (`codigo`, `nome_fantasia`, `razao_social`, `bairro`, `cidade`, `uf`, `tp_logr`, `nm_logr`, `nr_logr`, `updated_at`, `created_at`) values ('p-rVwjhcQqNxzJCUM8JAq3bsqMztpWunetTccUfaavA', '', 'VILAREJO COMERCIO DE ALIMENTOS LTDA', 'CENTRO', 'CASCAVEL', 'PR', 'RUA', 'PERNAMBUCO', '1464', '2026-01-24 21:36:37', '2026-01-24 21:36:37')
select * from `menorpreco_estabelecimentos` where (`codigo` = 'uFAus3q0goK3iUARPmeND9-bttK6sHqKdDfMXE7xTZ8') limit 1
insert into `menorpreco_historico_precos` (`produto_id`, `estabelecimento_id`, `data_coleta`, `preco`, `preco_tabela`, `desconto`, `distancia_km`, `datahora_nota`, `updated_at`, `created_at`) values (357, 15, '2026-01-24 00:00:00', '27.79', '30.65', '2.86', '2.133', '2026-01-24 20:46:31', '2026-01-24 21:40:51', '2026-01-24 21:40:51')
select * from `menorpreco_historico_precos` where (`produto_id` = 357 and `estabelecimento_id` = 15 and `data_coleta` = '2026-01-24') limit 1
---

            $est = $p['estabelecimento'];

            $estabelecimento = MenorprecoEstabelecimento::firstOrCreate(
                ['codigo' => $est['codigo']],
                [
                    'nome_fantasia' => $est['nm_fan'] ?? null,
                    'razao_social'  => $est['nm_emp'] ?? null,
                    'bairro'        => $est['bairro'] ?? null,
                    'cidade'        => $est['mun'],
                    'uf'            => $est['uf'],
                    'tp_logr'       => $est['tp_logr'] ?? null,
                    'nm_logr'       => $est['nm_logr'] ?? null,
                    'nr_logr'       => $est['nr_logr'] ?? null,
                ]
            );

            /** ---------------- HISTÓRICO ---------------- */
            MenorprecoHistoricoPreco::updateOrCreate(
                [
                    'produto_id'         => $produto->id,
                    'estabelecimento_id' => $estabelecimento->id,
                    'data_coleta'        => now()->toDateString(),
                ],
                [
                    'preco'         => $p['valor'],
                    'preco_tabela'  => $p['valor_tabela'] ?? null,
                    'desconto'      => $p['valor_desconto'] ?? null,
                    'distancia_km'  => $p['distkm'] ?? null,
                    'datahora_nota' => $p['datahora'] ?? null,
                ]
            );